code_verification/thermal_diffusion_model/simulation_setup/template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          76;
        startFace       23865;
    }
    outlet
    {
        type            patch;
        nFaces          76;
        startFace       23941;
    }
    externalwallSolid
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          448;
        startFace       24017;
    }
    wallInletSolid
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          47;
        startFace       24465;
    }
    wallOutletSolid
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          47;
        startFace       24512;
    }
    wallpm
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2380;
        startFace       24559;
    }
    wallin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          112;
        startFace       26939;
    }
)

// ************************************************************************* //
