code_verification/thermal_diffusion_model/simulation_setup/template/system/wallQ_caseSolid
type        wallHeatFlux;
libs        ("libfieldFunctionObjects.so");
region      caseSolid;
patches     (caseSolid_to_pipeFluid);