code_verification/thermal_diffusion_model/simulation_setup/template/system/wallQ_pipeFluid
type        wallHeatFlux;
libs        ("libfieldFunctionObjects.so");
region      pipeFluid;
patches     (pipeFluid_to_caseSolid);